app/controllers/scenarios_controller.rb

SELECT "scenarios".* FROM "scenarios"
---
  def index
    @scenarios = Scenario.all

SELECT  "scenarios".* FROM "scenarios" WHERE "scenarios"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
    @scenario = Scenario.find(params[:id])

SELECT  "scenarios".* FROM "scenarios" WHERE "scenarios"."id" = ? LIMIT 1  [["id", 5]]
---
  def retirement
    @scenario = Scenario.find(params[:id])

INSERT INTO "scenarios" ("user_id", "description", "name", "ret_taxrate", "inflation_rate", "retirement_inflation", "education_inflation", "retirement_startage", "retirement_income", "education_endage", "education_startage", "education_expense", "socialsecurity_inflation", "other_startage", "other_income", "pension_startage", "pension_income", "socialsecurity_startage", "socialsecurity_income", "bonds_ret_ret", "intlstocks_ret_ret", "usstocks_ret_ret", "bonds_ret_pre", "intlstocks_ret_pre", "usstocks_ret_pre", "bonds_alloc_ret", "intlstocks_alloc_ret", "usstocks_alloc_ret", "bonds_alloc_pre", "intlstocks_alloc_pre", "usstocks_alloc_pre", "retplan_inflation", "taxaccount_savings", "taxaccount_assets", "rothira_savings", "rothira_assets", "tradira_savings", "tradira_assets", "retplan_savings", "retplan_assets", "life_expectancy", "current_age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    @scenario.retirement_age = params[:retirement_age]
    @scenario.current_age = params[:current_age]

    if @scenario.save

SELECT  "scenarios".* FROM "scenarios" WHERE "scenarios"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @scenario = Scenario.find(params[:id])

SELECT  "scenarios".* FROM "scenarios" WHERE "scenarios"."id" = ? LIMIT 1  [["id", 3]]
---
  def update
    @scenario = Scenario.find(params[:id])

UPDATE "scenarios" SET "intlstocks_ret_ret" = ?, "usstocks_ret_ret" = ?, "intlstocks_ret_pre" = ?, "usstocks_ret_pre" = ?, "updated_at" = ? WHERE "scenarios"."id" = ?  [["intlstocks_ret_ret", 13.0], ["usstocks_ret_ret", 12.0], ["intlstocks_ret_pre", 13.0], ["usstocks_ret_pre", 12.0], ["updated_at", "2016-06-11 01:50:49.496399"], ["id", 5]]
---
    @scenario.retirement_age = params[:retirement_age]
    @scenario.current_age = params[:current_age]

    if @scenario.save

SELECT  "scenarios".* FROM "scenarios" WHERE "scenarios"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "scenarios" WHERE "scenarios"."id" = ?  [["id", 1]]
---
  def destroy
    @scenario = Scenario.find(params[:id])

    @scenario.destroy